MikroElektronika/core_packages/PIC/XC8/def/PIC16F1765/mcu.h
extern volatile TMR5Lbits_t TMR5Lbits __at(0x49A);
// bitfield macros
#define _TMR5L_TMR_POSN                                     0x0
#define _TMR5L_TMR_POSITION                                 0x0
#define _TMR5L_TMR_SIZE                                     0x8
#define _TMR5L_TMR_LENGTH                                   0x8
#define _TMR5L_TMR_MASK                                     0xFF

// Register: TMR5H
#define TMR5H TMR5H
extern volatile unsigned char           TMR5H               __at(0x49B);
#ifndef _LIB_BUILD
asm("TMR5H equ 049Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR5Hbits_t;
extern volatile TMR5Hbits_t TMR5Hbits __at(0x49B);
// bitfield macros
#define _TMR5H_TMR_POSN                                     0x0
#define _TMR5H_TMR_POSITION                                 0x0
#define _TMR5H_TMR_SIZE                                     0x8
#define _TMR5H_TMR_LENGTH                                   0x8
#define _TMR5H_TMR_MASK                                     0xFF

// Register: T5CON
#define T5CON T5CON
extern volatile unsigned char           T5CON               __at(0x49C);
#ifndef _LIB_BUILD
asm("T5CON equ 049Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned                        :1;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
        unsigned CS                     :2;
    };
    struct {
        unsigned TMRON                  :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned                        :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned TMR5ON                 :1;
        unsigned                        :1;
        unsigned nT5SYNC                :1;
        unsigned                        :3;
        unsigned T5CS0                  :1;
        unsigned T5CS1                  :1;
    };
    struct {
        unsigned T5ON                   :1;
        unsigned                        :3;
        unsigned T5CKPS0                :1;
        unsigned T5CKPS1                :1;
        unsigned TMR5CS0                :1;
        unsigned TMR5CS1                :1;
    };
} T5CONbits_t;
extern volatile T5CONbits_t T5CONbits __at(0x49C);
// bitfield macros
#define _T5CON_ON_POSN                                      0x0
#define _T5CON_ON_POSITION                                  0x0
#define _T5CON_ON_SIZE                                      0x1
#define _T5CON_ON_LENGTH                                    0x1
#define _T5CON_ON_MASK                                      0x1
#define _T5CON_nSYNC_POSN                                   0x2
#define _T5CON_nSYNC_POSITION                               0x2
#define _T5CON_nSYNC_SIZE                                   0x1
#define _T5CON_nSYNC_LENGTH                                 0x1
#define _T5CON_nSYNC_MASK                                   0x4
#define _T5CON_CKPS_POSN                                    0x4
#define _T5CON_CKPS_POSITION                                0x4
#define _T5CON_CKPS_SIZE                                    0x2
#define _T5CON_CKPS_LENGTH                                  0x2
#define _T5CON_CKPS_MASK                                    0x30
#define _T5CON_CS_POSN                                      0x6
#define _T5CON_CS_POSITION                                  0x6
#define _T5CON_CS_SIZE                                      0x2
#define _T5CON_CS_LENGTH                                    0x2
#define _T5CON_CS_MASK                                      0xC0
#define _T5CON_TMRON_POSN                                   0x0
#define _T5CON_TMRON_POSITION                               0x0
#define _T5CON_TMRON_SIZE                                   0x1
#define _T5CON_TMRON_LENGTH                                 0x1
#define _T5CON_TMRON_MASK                                   0x1
#define _T5CON_SYNC_POSN                                    0x2
#define _T5CON_SYNC_POSITION                                0x2
#define _T5CON_SYNC_SIZE                                    0x1
#define _T5CON_SYNC_LENGTH                                  0x1
#define _T5CON_SYNC_MASK                                    0x4
#define _T5CON_CKPS0_POSN                                   0x4
#define _T5CON_CKPS0_POSITION                               0x4
#define _T5CON_CKPS0_SIZE                                   0x1
#define _T5CON_CKPS0_LENGTH                                 0x1
#define _T5CON_CKPS0_MASK                                   0x10
#define _T5CON_CKPS1_POSN                                   0x5
#define _T5CON_CKPS1_POSITION                               0x5
#define _T5CON_CKPS1_SIZE                                   0x1
#define _T5CON_CKPS1_LENGTH                                 0x1
#define _T5CON_CKPS1_MASK                                   0x20
#define _T5CON_CS0_POSN                                     0x6
#define _T5CON_CS0_POSITION                                 0x6
#define _T5CON_CS0_SIZE                                     0x1
#define _T5CON_CS0_LENGTH                                   0x1
#define _T5CON_CS0_MASK                                     0x40
#define _T5CON_CS1_POSN                                     0x7
#define _T5CON_CS1_POSITION                                 0x7
#define _T5CON_CS1_SIZE                                     0x1
#define _T5CON_CS1_LENGTH                                   0x1
#define _T5CON_CS1_MASK                                     0x80
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_nT5SYNC_POSN                                 0x2
#define _T5CON_nT5SYNC_POSITION                             0x2
#define _T5CON_nT5SYNC_SIZE                                 0x1
#define _T5CON_nT5SYNC_LENGTH                               0x1
#define _T5CON_nT5SYNC_MASK                                 0x4
#define _T5CON_T5CS0_POSN                                   0x6
#define _T5CON_T5CS0_POSITION                               0x6
#define _T5CON_T5CS0_SIZE                                   0x1
#define _T5CON_T5CS0_LENGTH                                 0x1
#define _T5CON_T5CS0_MASK                                   0x40
#define _T5CON_T5CS1_POSN                                   0x7
#define _T5CON_T5CS1_POSITION                               0x7
#define _T5CON_T5CS1_SIZE                                   0x1
#define _T5CON_T5CS1_LENGTH                                 0x1
#define _T5CON_T5CS1_MASK                                   0x80
#define _T5CON_T5ON_POSN                                    0x0
#define _T5CON_T5ON_POSITION                                0x0
#define _T5CON_T5ON_SIZE                                    0x1
#define _T5CON_T5ON_LENGTH                                  0x1
#define _T5CON_T5ON_MASK                                    0x1
#define _T5CON_T5CKPS0_POSN                                 0x4
#define _T5CON_T5CKPS0_POSITION                             0x4
#define _T5CON_T5CKPS0_SIZE                                 0x1
#define _T5CON_T5CKPS0_LENGTH                               0x1
#define _T5CON_T5CKPS0_MASK                                 0x10
#define _T5CON_T5CKPS1_POSN                                 0x5
#define _T5CON_T5CKPS1_POSITION                             0x5
#define _T5CON_T5CKPS1_SIZE                                 0x1
#define _T5CON_T5CKPS1_LENGTH                               0x1
#define _T5CON_T5CKPS1_MASK                                 0x20
#define _T5CON_TMR5CS0_POSN                                 0x6
#define _T5CON_TMR5CS0_POSITION                             0x6
#define _T5CON_TMR5CS0_SIZE                                 0x1
#define _T5CON_TMR5CS0_LENGTH                               0x1
#define _T5CON_TMR5CS0_MASK                                 0x40
#define _T5CON_TMR5CS1_POSN                                 0x7
#define _T5CON_TMR5CS1_POSITION                             0x7
#define _T5CON_TMR5CS1_SIZE                                 0x1
#define _T5CON_TMR5CS1_LENGTH                               0x1
#define _T5CON_TMR5CS1_MASK                                 0x80

// Register: T5GCON
#define T5GCON T5GCON
extern volatile unsigned char           T5GCON              __at(0x49D);
#ifndef _LIB_BUILD
asm("T5GCON equ 049Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned                        :5;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned TMR5GE                 :1;
    };
    struct {
        unsigned T5GSS0                 :1;
        unsigned T5GSS1                 :1;
    };
} T5GCONbits_t;
extern volatile T5GCONbits_t T5GCONbits __at(0x49D);
// bitfield macros
#define _T5GCON_GSS_POSN                                    0x0
#define _T5GCON_GSS_POSITION                                0x0
#define _T5GCON_GSS_SIZE                                    0x2
#define _T5GCON_GSS_LENGTH                                  0x2
#define _T5GCON_GSS_MASK                                    0x3
#define _T5GCON_GVAL_POSN                                   0x2
#define _T5GCON_GVAL_POSITION                               0x2
#define _T5GCON_GVAL_SIZE                                   0x1
#define _T5GCON_GVAL_LENGTH                                 0x1
#define _T5GCON_GVAL_MASK                                   0x4
#define _T5GCON_GGO_nDONE_POSN                              0x3
#define _T5GCON_GGO_nDONE_POSITION                          0x3
#define _T5GCON_GGO_nDONE_SIZE                              0x1
#define _T5GCON_GGO_nDONE_LENGTH                            0x1
#define _T5GCON_GGO_nDONE_MASK                              0x8
#define _T5GCON_GSPM_POSN                                   0x4
#define _T5GCON_GSPM_POSITION                               0x4
#define _T5GCON_GSPM_SIZE                                   0x1
#define _T5GCON_GSPM_LENGTH                                 0x1
#define _T5GCON_GSPM_MASK                                   0x10
#define _T5GCON_GTM_POSN                                    0x5
#define _T5GCON_GTM_POSITION                                0x5
#define _T5GCON_GTM_SIZE                                    0x1
#define _T5GCON_GTM_LENGTH                                  0x1
#define _T5GCON_GTM_MASK                                    0x20
#define _T5GCON_GPOL_POSN                                   0x6
#define _T5GCON_GPOL_POSITION                               0x6
#define _T5GCON_GPOL_SIZE                                   0x1
#define _T5GCON_GPOL_LENGTH                                 0x1
#define _T5GCON_GPOL_MASK                                   0x40
#define _T5GCON_GE_POSN                                     0x7
#define _T5GCON_GE_POSITION                                 0x7
#define _T5GCON_GE_SIZE                                     0x1
#define _T5GCON_GE_LENGTH                                   0x1
#define _T5GCON_GE_MASK                                     0x80
#define _T5GCON_GSS0_POSN                                   0x0
#define _T5GCON_GSS0_POSITION                               0x0
#define _T5GCON_GSS0_SIZE                                   0x1
#define _T5GCON_GSS0_LENGTH                                 0x1
#define _T5GCON_GSS0_MASK                                   0x1
#define _T5GCON_GSS1_POSN                                   0x1
#define _T5GCON_GSS1_POSITION                               0x1
#define _T5GCON_GSS1_SIZE                                   0x1
#define _T5GCON_GSS1_LENGTH                                 0x1
#define _T5GCON_GSS1_MASK                                   0x2
#define _T5GCON_T5GE_POSN                                   0x7
#define _T5GCON_T5GE_POSITION                               0x7
#define _T5GCON_T5GE_SIZE                                   0x1
#define _T5GCON_T5GE_LENGTH                                 0x1
#define _T5GCON_T5GE_MASK                                   0x80
#define _T5GCON_T5GVAL_POSN                                 0x2
#define _T5GCON_T5GVAL_POSITION                             0x2
#define _T5GCON_T5GVAL_SIZE                                 0x1
#define _T5GCON_T5GVAL_LENGTH                               0x1
#define _T5GCON_T5GVAL_MASK                                 0x4
#define _T5GCON_T5GGO_nDONE_POSN                            0x3
#define _T5GCON_T5GGO_nDONE_POSITION                        0x3
#define _T5GCON_T5GGO_nDONE_SIZE                            0x1
#define _T5GCON_T5GGO_nDONE_LENGTH                          0x1
#define _T5GCON_T5GGO_nDONE_MASK                            0x8
#define _T5GCON_T5GSPM_POSN                                 0x4
#define _T5GCON_T5GSPM_POSITION                             0x4
#define _T5GCON_T5GSPM_SIZE                                 0x1
#define _T5GCON_T5GSPM_LENGTH                               0x1
#define _T5GCON_T5GSPM_MASK                                 0x10
#define _T5GCON_T5GTM_POSN                                  0x5
#define _T5GCON_T5GTM_POSITION                              0x5
#define _T5GCON_T5GTM_SIZE                                  0x1
#define _T5GCON_T5GTM_LENGTH                                0x1
#define _T5GCON_T5GTM_MASK                                  0x20
#define _T5GCON_T5GPOL_POSN                                 0x6
#define _T5GCON_T5GPOL_POSITION                             0x6
#define _T5GCON_T5GPOL_SIZE                                 0x1
#define _T5GCON_T5GPOL_LENGTH                               0x1
#define _T5GCON_T5GPOL_MASK                                 0x40
#define _T5GCON_TMR5GE_POSN                                 0x7
#define _T5GCON_TMR5GE_POSITION                             0x7
#define _T5GCON_TMR5GE_SIZE                                 0x1
#define _T5GCON_TMR5GE_LENGTH                               0x1
#define _T5GCON_TMR5GE_MASK                                 0x80
#define _T5GCON_T5GSS0_POSN                                 0x0
#define _T5GCON_T5GSS0_POSITION                             0x0
#define _T5GCON_T5GSS0_SIZE                                 0x1
#define _T5GCON_T5GSS0_LENGTH                               0x1
#define _T5GCON_T5GSS0_MASK                                 0x1
#define _T5GCON_T5GSS1_POSN                                 0x1
#define _T5GCON_T5GSS1_POSITION                             0x1
#define _T5GCON_T5GSS1_SIZE                                 0x1
#define _T5GCON_T5GSS1_LENGTH                               0x1
#define _T5GCON_T5GSS1_MASK                                 0x2

// Register: OPA1NCHS
#define OPA1NCHS OPA1NCHS
extern volatile unsigned char           OPA1NCHS            __at(0x50F);
#ifndef _LIB_BUILD
asm("OPA1NCHS equ 050Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :8;
    };
    struct {
        unsigned OPA1NCH                :8;
    };
} OPA1NCHSbits_t;
extern volatile OPA1NCHSbits_t OPA1NCHSbits __at(0x50F);
// bitfield macros
#define _OPA1NCHS_NCH_POSN                                  0x0
#define _OPA1NCHS_NCH_POSITION                              0x0
#define _OPA1NCHS_NCH_SIZE                                  0x8
#define _OPA1NCHS_NCH_LENGTH                                0x8
#define _OPA1NCHS_NCH_MASK                                  0xFF
#define _OPA1NCHS_OPA1NCH_POSN                              0x0
#define _OPA1NCHS_OPA1NCH_POSITION                          0x0
#define _OPA1NCHS_OPA1NCH_SIZE                              0x8
#define _OPA1NCHS_OPA1NCH_LENGTH                            0x8
#define _OPA1NCHS_OPA1NCH_MASK                              0xFF

// Register: OPA1PCHS
#define OPA1PCHS OPA1PCHS
extern volatile unsigned char           OPA1PCHS            __at(0x510);
#ifndef _LIB_BUILD
asm("OPA1PCHS equ 0510h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
    struct {
        unsigned OPA1PCH                :8;
    };
} OPA1PCHSbits_t;
extern volatile OPA1PCHSbits_t OPA1PCHSbits __at(0x510);
// bitfield macros
#define _OPA1PCHS_PCH_POSN                                  0x0
#define _OPA1PCHS_PCH_POSITION                              0x0
#define _OPA1PCHS_PCH_SIZE                                  0x8
#define _OPA1PCHS_PCH_LENGTH                                0x8
#define _OPA1PCHS_PCH_MASK                                  0xFF
#define _OPA1PCHS_OPA1PCH_POSN                              0x0
#define _OPA1PCHS_OPA1PCH_POSITION                          0x0
#define _OPA1PCHS_OPA1PCH_SIZE                              0x8
#define _OPA1PCHS_OPA1PCH_LENGTH                            0x8
#define _OPA1PCHS_OPA1PCH_MASK                              0xFF

