MikroElektronika/core_packages/PIC/XC8/def/PIC16F1765/mcu.h
// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x511);
#ifndef _LIB_BUILD
asm("OPA1CON equ 0511h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORM                    :2;
        unsigned ORPOL                  :1;
        unsigned                        :1;
        unsigned UG                     :1;
        unsigned                        :2;
        unsigned EN                     :1;
    };
    struct {
        unsigned ORM0                   :1;
        unsigned ORM1                   :1;
    };
    struct {
        unsigned OPA1ORM                :2;
        unsigned OPA1ORPOL              :1;
        unsigned                        :1;
        unsigned OPA1UG                 :1;
        unsigned                        :2;
        unsigned OPA1EN                 :1;
    };
    struct {
        unsigned OPA1ORM0               :1;
        unsigned OPA1ORM1               :1;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x511);
// bitfield macros
#define _OPA1CON_ORM_POSN                                   0x0
#define _OPA1CON_ORM_POSITION                               0x0
#define _OPA1CON_ORM_SIZE                                   0x2
#define _OPA1CON_ORM_LENGTH                                 0x2
#define _OPA1CON_ORM_MASK                                   0x3
#define _OPA1CON_ORPOL_POSN                                 0x2
#define _OPA1CON_ORPOL_POSITION                             0x2
#define _OPA1CON_ORPOL_SIZE                                 0x1
#define _OPA1CON_ORPOL_LENGTH                               0x1
#define _OPA1CON_ORPOL_MASK                                 0x4
#define _OPA1CON_UG_POSN                                    0x4
#define _OPA1CON_UG_POSITION                                0x4
#define _OPA1CON_UG_SIZE                                    0x1
#define _OPA1CON_UG_LENGTH                                  0x1
#define _OPA1CON_UG_MASK                                    0x10
#define _OPA1CON_EN_POSN                                    0x7
#define _OPA1CON_EN_POSITION                                0x7
#define _OPA1CON_EN_SIZE                                    0x1
#define _OPA1CON_EN_LENGTH                                  0x1
#define _OPA1CON_EN_MASK                                    0x80
#define _OPA1CON_ORM0_POSN                                  0x0
#define _OPA1CON_ORM0_POSITION                              0x0
#define _OPA1CON_ORM0_SIZE                                  0x1
#define _OPA1CON_ORM0_LENGTH                                0x1
#define _OPA1CON_ORM0_MASK                                  0x1
#define _OPA1CON_ORM1_POSN                                  0x1
#define _OPA1CON_ORM1_POSITION                              0x1
#define _OPA1CON_ORM1_SIZE                                  0x1
#define _OPA1CON_ORM1_LENGTH                                0x1
#define _OPA1CON_ORM1_MASK                                  0x2
#define _OPA1CON_OPA1ORM_POSN                               0x0
#define _OPA1CON_OPA1ORM_POSITION                           0x0
#define _OPA1CON_OPA1ORM_SIZE                               0x2
#define _OPA1CON_OPA1ORM_LENGTH                             0x2
#define _OPA1CON_OPA1ORM_MASK                               0x3
#define _OPA1CON_OPA1ORPOL_POSN                             0x2
#define _OPA1CON_OPA1ORPOL_POSITION                         0x2
#define _OPA1CON_OPA1ORPOL_SIZE                             0x1
#define _OPA1CON_OPA1ORPOL_LENGTH                           0x1
#define _OPA1CON_OPA1ORPOL_MASK                             0x4
#define _OPA1CON_OPA1UG_POSN                                0x4
#define _OPA1CON_OPA1UG_POSITION                            0x4
#define _OPA1CON_OPA1UG_SIZE                                0x1
#define _OPA1CON_OPA1UG_LENGTH                              0x1
#define _OPA1CON_OPA1UG_MASK                                0x10
#define _OPA1CON_OPA1EN_POSN                                0x7
#define _OPA1CON_OPA1EN_POSITION                            0x7
#define _OPA1CON_OPA1EN_SIZE                                0x1
#define _OPA1CON_OPA1EN_LENGTH                              0x1
#define _OPA1CON_OPA1EN_MASK                                0x80
#define _OPA1CON_OPA1ORM0_POSN                              0x0
#define _OPA1CON_OPA1ORM0_POSITION                          0x0
#define _OPA1CON_OPA1ORM0_SIZE                              0x1
#define _OPA1CON_OPA1ORM0_LENGTH                            0x1
#define _OPA1CON_OPA1ORM0_MASK                              0x1
#define _OPA1CON_OPA1ORM1_POSN                              0x1
#define _OPA1CON_OPA1ORM1_POSITION                          0x1
#define _OPA1CON_OPA1ORM1_SIZE                              0x1
#define _OPA1CON_OPA1ORM1_LENGTH                            0x1
#define _OPA1CON_OPA1ORM1_MASK                              0x2

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
extern volatile unsigned char           OPA1ORS             __at(0x512);
#ifndef _LIB_BUILD
asm("OPA1ORS equ 0512h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
} OPA1ORSbits_t;
extern volatile OPA1ORSbits_t OPA1ORSbits __at(0x512);
// bitfield macros
#define _OPA1ORS_ORS_POSN                                   0x0
#define _OPA1ORS_ORS_POSITION                               0x0
#define _OPA1ORS_ORS_SIZE                                   0x8
#define _OPA1ORS_ORS_LENGTH                                 0x8
#define _OPA1ORS_ORS_MASK                                   0xFF

// Register: DACLD
#define DACLD DACLD
extern volatile unsigned char           DACLD               __at(0x590);
#ifndef _LIB_BUILD
asm("DACLD equ 0590h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1LD                 :1;
    };
} DACLDbits_t;
extern volatile DACLDbits_t DACLDbits __at(0x590);
// bitfield macros
#define _DACLD_DAC1LD_POSN                                  0x0
#define _DACLD_DAC1LD_POSITION                              0x0
#define _DACLD_DAC1LD_SIZE                                  0x1
#define _DACLD_DAC1LD_LENGTH                                0x1
#define _DACLD_DAC1LD_MASK                                  0x1

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
extern volatile unsigned char           DAC1CON0            __at(0x591);
#ifndef _LIB_BUILD
asm("DAC1CON0 equ 0591h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned                        :1;
        unsigned OE1                    :1;
        unsigned FM                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :1;
        unsigned OE                     :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE1                 :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned                        :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
        unsigned                        :1;
        unsigned DACOE                  :1;
    };
    struct {
        unsigned DAC1NSS                :2;
        unsigned DAC1PSS                :2;
        unsigned                        :1;
        unsigned DAC1OE1                :1;
        unsigned DAC1FM                 :1;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned DAC1NSS0               :1;
        unsigned                        :1;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
    };
} DAC1CON0bits_t;
extern volatile DAC1CON0bits_t DAC1CON0bits __at(0x591);
// bitfield macros
#define _DAC1CON0_NSS_POSN                                  0x0
#define _DAC1CON0_NSS_POSITION                              0x0
#define _DAC1CON0_NSS_SIZE                                  0x2
#define _DAC1CON0_NSS_LENGTH                                0x2
#define _DAC1CON0_NSS_MASK                                  0x3
#define _DAC1CON0_PSS_POSN                                  0x2
#define _DAC1CON0_PSS_POSITION                              0x2
#define _DAC1CON0_PSS_SIZE                                  0x2
#define _DAC1CON0_PSS_LENGTH                                0x2
#define _DAC1CON0_PSS_MASK                                  0xC
#define _DAC1CON0_OE1_POSN                                  0x5
#define _DAC1CON0_OE1_POSITION                              0x5
#define _DAC1CON0_OE1_SIZE                                  0x1
#define _DAC1CON0_OE1_LENGTH                                0x1
#define _DAC1CON0_OE1_MASK                                  0x20
#define _DAC1CON0_FM_POSN                                   0x6
#define _DAC1CON0_FM_POSITION                               0x6
#define _DAC1CON0_FM_SIZE                                   0x1
#define _DAC1CON0_FM_LENGTH                                 0x1
#define _DAC1CON0_FM_MASK                                   0x40
#define _DAC1CON0_EN_POSN                                   0x7
#define _DAC1CON0_EN_POSITION                               0x7
#define _DAC1CON0_EN_SIZE                                   0x1
#define _DAC1CON0_EN_LENGTH                                 0x1
#define _DAC1CON0_EN_MASK                                   0x80
#define _DAC1CON0_NSS0_POSN                                 0x0
#define _DAC1CON0_NSS0_POSITION                             0x0
#define _DAC1CON0_NSS0_SIZE                                 0x1
#define _DAC1CON0_NSS0_LENGTH                               0x1
#define _DAC1CON0_NSS0_MASK                                 0x1
#define _DAC1CON0_PSS0_POSN                                 0x2
#define _DAC1CON0_PSS0_POSITION                             0x2
#define _DAC1CON0_PSS0_SIZE                                 0x1
#define _DAC1CON0_PSS0_LENGTH                               0x1
#define _DAC1CON0_PSS0_MASK                                 0x4
#define _DAC1CON0_PSS1_POSN                                 0x3
#define _DAC1CON0_PSS1_POSITION                             0x3
#define _DAC1CON0_PSS1_SIZE                                 0x1
#define _DAC1CON0_PSS1_LENGTH                               0x1
#define _DAC1CON0_PSS1_MASK                                 0x8
#define _DAC1CON0_OE_POSN                                   0x5
#define _DAC1CON0_OE_POSITION                               0x5
#define _DAC1CON0_OE_SIZE                                   0x1
#define _DAC1CON0_OE_LENGTH                                 0x1
#define _DAC1CON0_OE_MASK                                   0x20
#define _DAC1CON0_DACNSS_POSN                               0x0
#define _DAC1CON0_DACNSS_POSITION                           0x0
#define _DAC1CON0_DACNSS_SIZE                               0x2
#define _DAC1CON0_DACNSS_LENGTH                             0x2
#define _DAC1CON0_DACNSS_MASK                               0x3
#define _DAC1CON0_DACPSS_POSN                               0x2
#define _DAC1CON0_DACPSS_POSITION                           0x2
#define _DAC1CON0_DACPSS_SIZE                               0x2
#define _DAC1CON0_DACPSS_LENGTH                             0x2
#define _DAC1CON0_DACPSS_MASK                               0xC
#define _DAC1CON0_DACOE1_POSN                               0x5
#define _DAC1CON0_DACOE1_POSITION                           0x5
#define _DAC1CON0_DACOE1_SIZE                               0x1
#define _DAC1CON0_DACOE1_LENGTH                             0x1
#define _DAC1CON0_DACOE1_MASK                               0x20
#define _DAC1CON0_DACFM_POSN                                0x6
#define _DAC1CON0_DACFM_POSITION                            0x6
#define _DAC1CON0_DACFM_SIZE                                0x1
#define _DAC1CON0_DACFM_LENGTH                              0x1
#define _DAC1CON0_DACFM_MASK                                0x40
#define _DAC1CON0_DACEN_POSN                                0x7
#define _DAC1CON0_DACEN_POSITION                            0x7
#define _DAC1CON0_DACEN_SIZE                                0x1
#define _DAC1CON0_DACEN_LENGTH                              0x1
#define _DAC1CON0_DACEN_MASK                                0x80
#define _DAC1CON0_DACNSS0_POSN                              0x0
#define _DAC1CON0_DACNSS0_POSITION                          0x0
#define _DAC1CON0_DACNSS0_SIZE                              0x1
#define _DAC1CON0_DACNSS0_LENGTH                            0x1
#define _DAC1CON0_DACNSS0_MASK                              0x1
#define _DAC1CON0_DACPSS0_POSN                              0x2
#define _DAC1CON0_DACPSS0_POSITION                          0x2
#define _DAC1CON0_DACPSS0_SIZE                              0x1
#define _DAC1CON0_DACPSS0_LENGTH                            0x1
#define _DAC1CON0_DACPSS0_MASK                              0x4
#define _DAC1CON0_DACPSS1_POSN                              0x3
#define _DAC1CON0_DACPSS1_POSITION                          0x3
#define _DAC1CON0_DACPSS1_SIZE                              0x1
#define _DAC1CON0_DACPSS1_LENGTH                            0x1
#define _DAC1CON0_DACPSS1_MASK                              0x8
#define _DAC1CON0_DACOE_POSN                                0x5
#define _DAC1CON0_DACOE_POSITION                            0x5
#define _DAC1CON0_DACOE_SIZE                                0x1
#define _DAC1CON0_DACOE_LENGTH                              0x1
#define _DAC1CON0_DACOE_MASK                                0x20
#define _DAC1CON0_DAC1NSS_POSN                              0x0
#define _DAC1CON0_DAC1NSS_POSITION                          0x0
#define _DAC1CON0_DAC1NSS_SIZE                              0x2
#define _DAC1CON0_DAC1NSS_LENGTH                            0x2
#define _DAC1CON0_DAC1NSS_MASK                              0x3
#define _DAC1CON0_DAC1PSS_POSN                              0x2
#define _DAC1CON0_DAC1PSS_POSITION                          0x2
#define _DAC1CON0_DAC1PSS_SIZE                              0x2
#define _DAC1CON0_DAC1PSS_LENGTH                            0x2
#define _DAC1CON0_DAC1PSS_MASK                              0xC
#define _DAC1CON0_DAC1OE1_POSN                              0x5
#define _DAC1CON0_DAC1OE1_POSITION                          0x5
#define _DAC1CON0_DAC1OE1_SIZE                              0x1
#define _DAC1CON0_DAC1OE1_LENGTH                            0x1
#define _DAC1CON0_DAC1OE1_MASK                              0x20
#define _DAC1CON0_DAC1FM_POSN                               0x6
#define _DAC1CON0_DAC1FM_POSITION                           0x6
#define _DAC1CON0_DAC1FM_SIZE                               0x1
#define _DAC1CON0_DAC1FM_LENGTH                             0x1
#define _DAC1CON0_DAC1FM_MASK                               0x40
#define _DAC1CON0_DAC1EN_POSN                               0x7
#define _DAC1CON0_DAC1EN_POSITION                           0x7
#define _DAC1CON0_DAC1EN_SIZE                               0x1
#define _DAC1CON0_DAC1EN_LENGTH                             0x1
#define _DAC1CON0_DAC1EN_MASK                               0x80
#define _DAC1CON0_DAC1NSS0_POSN                             0x0
#define _DAC1CON0_DAC1NSS0_POSITION                         0x0
#define _DAC1CON0_DAC1NSS0_SIZE                             0x1
#define _DAC1CON0_DAC1NSS0_LENGTH                           0x1
#define _DAC1CON0_DAC1NSS0_MASK                             0x1
#define _DAC1CON0_DAC1PSS0_POSN                             0x2
#define _DAC1CON0_DAC1PSS0_POSITION                         0x2
#define _DAC1CON0_DAC1PSS0_SIZE                             0x1
#define _DAC1CON0_DAC1PSS0_LENGTH                           0x1
#define _DAC1CON0_DAC1PSS0_MASK                             0x4
#define _DAC1CON0_DAC1PSS1_POSN                             0x3
#define _DAC1CON0_DAC1PSS1_POSITION                         0x3
#define _DAC1CON0_DAC1PSS1_SIZE                             0x1
#define _DAC1CON0_DAC1PSS1_LENGTH                           0x1
#define _DAC1CON0_DAC1PSS1_MASK                             0x8

// Register: DAC1REF
#define DAC1REF DAC1REF
extern volatile unsigned short          DAC1REF             __at(0x592);
#ifndef _LIB_BUILD
asm("DAC1REF equ 0592h");
#endif

