MikroElektronika/core_packages/PIC/XC8/def/PIC16F1765/mcu.h
#define                                 PWM5CS1_bit         _BIT_ACCESS(PWM5CLKCON,1)
// PWM5CLKCON<PWM5CS2>
extern volatile __bit                   PWM5CS2             __at(0x6CF2);	// @ (0xD9E * 8 + 2)
#define                                 PWM5CS2_bit         _BIT_ACCESS(PWM5CLKCON,2)
// PWM5DCH<PWM5DCH0>
extern volatile __bit                   PWM5DCH0            __at(0x6CA0);	// @ (0xD94 * 8 + 0)
#define                                 PWM5DCH0_bit        _BIT_ACCESS(PWM5DCH,0)
// PWM5DCH<PWM5DCH1>
extern volatile __bit                   PWM5DCH1            __at(0x6CA1);	// @ (0xD94 * 8 + 1)
#define                                 PWM5DCH1_bit        _BIT_ACCESS(PWM5DCH,1)
// PWM5DCH<PWM5DCH2>
extern volatile __bit                   PWM5DCH2            __at(0x6CA2);	// @ (0xD94 * 8 + 2)
#define                                 PWM5DCH2_bit        _BIT_ACCESS(PWM5DCH,2)
// PWM5DCH<PWM5DCH3>
extern volatile __bit                   PWM5DCH3            __at(0x6CA3);	// @ (0xD94 * 8 + 3)
#define                                 PWM5DCH3_bit        _BIT_ACCESS(PWM5DCH,3)
// PWM5DCH<PWM5DCH4>
extern volatile __bit                   PWM5DCH4            __at(0x6CA4);	// @ (0xD94 * 8 + 4)
#define                                 PWM5DCH4_bit        _BIT_ACCESS(PWM5DCH,4)
// PWM5DCH<PWM5DCH5>
extern volatile __bit                   PWM5DCH5            __at(0x6CA5);	// @ (0xD94 * 8 + 5)
#define                                 PWM5DCH5_bit        _BIT_ACCESS(PWM5DCH,5)
// PWM5DCH<PWM5DCH6>
extern volatile __bit                   PWM5DCH6            __at(0x6CA6);	// @ (0xD94 * 8 + 6)
#define                                 PWM5DCH6_bit        _BIT_ACCESS(PWM5DCH,6)
// PWM5DCH<PWM5DCH7>
extern volatile __bit                   PWM5DCH7            __at(0x6CA7);	// @ (0xD94 * 8 + 7)
#define                                 PWM5DCH7_bit        _BIT_ACCESS(PWM5DCH,7)
// PWM5INTE<PWM5DCIE>
extern volatile __bit                   PWM5DCIE            __at(0x6CE1);	// @ (0xD9C * 8 + 1)
#define                                 PWM5DCIE_bit        _BIT_ACCESS(PWM5INTE,1)
// PWM5INTF<PWM5DCIF>
extern volatile __bit                   PWM5DCIF            __at(0x6CE9);	// @ (0xD9D * 8 + 1)
#define                                 PWM5DCIF_bit        _BIT_ACCESS(PWM5INTF,1)
// PWM5DCL<PWM5DCL0>
extern volatile __bit                   PWM5DCL0            __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 PWM5DCL0_bit        _BIT_ACCESS(PWM5DCL,0)
// PWM5DCL<PWM5DCL1>
extern volatile __bit                   PWM5DCL1            __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 PWM5DCL1_bit        _BIT_ACCESS(PWM5DCL,1)
// PWM5DCL<PWM5DCL2>
extern volatile __bit                   PWM5DCL2            __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 PWM5DCL2_bit        _BIT_ACCESS(PWM5DCL,2)
// PWM5DCL<PWM5DCL3>
extern volatile __bit                   PWM5DCL3            __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 PWM5DCL3_bit        _BIT_ACCESS(PWM5DCL,3)
// PWM5DCL<PWM5DCL4>
extern volatile __bit                   PWM5DCL4            __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 PWM5DCL4_bit        _BIT_ACCESS(PWM5DCL,4)
// PWM5DCL<PWM5DCL5>
extern volatile __bit                   PWM5DCL5            __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 PWM5DCL5_bit        _BIT_ACCESS(PWM5DCL,5)
// PWM5DCL<PWM5DCL6>
extern volatile __bit                   PWM5DCL6            __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 PWM5DCL6_bit        _BIT_ACCESS(PWM5DCL,6)
// PWM5DCL<PWM5DCL7>
extern volatile __bit                   PWM5DCL7            __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 PWM5DCL7_bit        _BIT_ACCESS(PWM5DCL,7)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x6CDF);	// @ (0xD9B * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PIE3<PWM5IE>
extern volatile __bit                   PWM5IE              __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 PWM5IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<PWM5IF>
extern volatile __bit                   PWM5IF              __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 PWM5IF_bit          _BIT_ACCESS(PIR3,6)
// PWM5LDCON<PWM5LD>
extern volatile __bit                   PWM5LD              __at(0x6CFF);	// @ (0xD9F * 8 + 7)
#define                                 PWM5LD_bit          _BIT_ACCESS(PWM5LDCON,7)
// PWM5CON<PWM5MODE0>
extern volatile __bit                   PWM5MODE0           __at(0x6CDA);	// @ (0xD9B * 8 + 2)
#define                                 PWM5MODE0_bit       _BIT_ACCESS(PWM5CON,2)
// PWM5CON<PWM5MODE1>
extern volatile __bit                   PWM5MODE1           __at(0x6CDB);	// @ (0xD9B * 8 + 3)
#define                                 PWM5MODE1_bit       _BIT_ACCESS(PWM5CON,3)
// PWM5OFH<PWM5OFH0>
extern volatile __bit                   PWM5OFH0            __at(0x6CC0);	// @ (0xD98 * 8 + 0)
#define                                 PWM5OFH0_bit        _BIT_ACCESS(PWM5OFH,0)
// PWM5OFH<PWM5OFH1>
extern volatile __bit                   PWM5OFH1            __at(0x6CC1);	// @ (0xD98 * 8 + 1)
#define                                 PWM5OFH1_bit        _BIT_ACCESS(PWM5OFH,1)
// PWM5OFH<PWM5OFH2>
extern volatile __bit                   PWM5OFH2            __at(0x6CC2);	// @ (0xD98 * 8 + 2)
#define                                 PWM5OFH2_bit        _BIT_ACCESS(PWM5OFH,2)
// PWM5OFH<PWM5OFH3>
extern volatile __bit                   PWM5OFH3            __at(0x6CC3);	// @ (0xD98 * 8 + 3)
#define                                 PWM5OFH3_bit        _BIT_ACCESS(PWM5OFH,3)
// PWM5OFH<PWM5OFH4>
extern volatile __bit                   PWM5OFH4            __at(0x6CC4);	// @ (0xD98 * 8 + 4)
#define                                 PWM5OFH4_bit        _BIT_ACCESS(PWM5OFH,4)
// PWM5OFH<PWM5OFH5>
extern volatile __bit                   PWM5OFH5            __at(0x6CC5);	// @ (0xD98 * 8 + 5)
#define                                 PWM5OFH5_bit        _BIT_ACCESS(PWM5OFH,5)
// PWM5OFH<PWM5OFH6>
extern volatile __bit                   PWM5OFH6            __at(0x6CC6);	// @ (0xD98 * 8 + 6)
#define                                 PWM5OFH6_bit        _BIT_ACCESS(PWM5OFH,6)
// PWM5OFH<PWM5OFH7>
extern volatile __bit                   PWM5OFH7            __at(0x6CC7);	// @ (0xD98 * 8 + 7)
#define                                 PWM5OFH7_bit        _BIT_ACCESS(PWM5OFH,7)
// PWM5INTE<PWM5OFIE>
extern volatile __bit                   PWM5OFIE            __at(0x6CE3);	// @ (0xD9C * 8 + 3)
#define                                 PWM5OFIE_bit        _BIT_ACCESS(PWM5INTE,3)
// PWM5INTF<PWM5OFIF>
extern volatile __bit                   PWM5OFIF            __at(0x6CEB);	// @ (0xD9D * 8 + 3)
#define                                 PWM5OFIF_bit        _BIT_ACCESS(PWM5INTF,3)
// PWM5OFL<PWM5OFL0>
extern volatile __bit                   PWM5OFL0            __at(0x6CB8);	// @ (0xD97 * 8 + 0)
#define                                 PWM5OFL0_bit        _BIT_ACCESS(PWM5OFL,0)
// PWM5OFL<PWM5OFL1>
extern volatile __bit                   PWM5OFL1            __at(0x6CB9);	// @ (0xD97 * 8 + 1)
#define                                 PWM5OFL1_bit        _BIT_ACCESS(PWM5OFL,1)
// PWM5OFL<PWM5OFL2>
extern volatile __bit                   PWM5OFL2            __at(0x6CBA);	// @ (0xD97 * 8 + 2)
#define                                 PWM5OFL2_bit        _BIT_ACCESS(PWM5OFL,2)
// PWM5OFL<PWM5OFL3>
extern volatile __bit                   PWM5OFL3            __at(0x6CBB);	// @ (0xD97 * 8 + 3)
#define                                 PWM5OFL3_bit        _BIT_ACCESS(PWM5OFL,3)
// PWM5OFL<PWM5OFL4>
extern volatile __bit                   PWM5OFL4            __at(0x6CBC);	// @ (0xD97 * 8 + 4)
#define                                 PWM5OFL4_bit        _BIT_ACCESS(PWM5OFL,4)
// PWM5OFL<PWM5OFL5>
extern volatile __bit                   PWM5OFL5            __at(0x6CBD);	// @ (0xD97 * 8 + 5)
#define                                 PWM5OFL5_bit        _BIT_ACCESS(PWM5OFL,5)
// PWM5OFL<PWM5OFL6>
extern volatile __bit                   PWM5OFL6            __at(0x6CBE);	// @ (0xD97 * 8 + 6)
#define                                 PWM5OFL6_bit        _BIT_ACCESS(PWM5OFL,6)
// PWM5OFL<PWM5OFL7>
extern volatile __bit                   PWM5OFL7            __at(0x6CBF);	// @ (0xD97 * 8 + 7)
#define                                 PWM5OFL7_bit        _BIT_ACCESS(PWM5OFL,7)
// PWM5OFCON<PWM5OFMC>
extern volatile __bit                   PWM5OFMC            __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 PWM5OFMC_bit        _BIT_ACCESS(PWM5OFCON,4)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x6CDD);	// @ (0xD9B * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5PHH<PWM5PHH0>
extern volatile __bit                   PWM5PHH0            __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 PWM5PHH0_bit        _BIT_ACCESS(PWM5PHH,0)
// PWM5PHH<PWM5PHH1>
extern volatile __bit                   PWM5PHH1            __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 PWM5PHH1_bit        _BIT_ACCESS(PWM5PHH,1)
// PWM5PHH<PWM5PHH2>
extern volatile __bit                   PWM5PHH2            __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 PWM5PHH2_bit        _BIT_ACCESS(PWM5PHH,2)
// PWM5PHH<PWM5PHH3>
extern volatile __bit                   PWM5PHH3            __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 PWM5PHH3_bit        _BIT_ACCESS(PWM5PHH,3)
// PWM5PHH<PWM5PHH4>
extern volatile __bit                   PWM5PHH4            __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 PWM5PHH4_bit        _BIT_ACCESS(PWM5PHH,4)
// PWM5PHH<PWM5PHH5>
extern volatile __bit                   PWM5PHH5            __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 PWM5PHH5_bit        _BIT_ACCESS(PWM5PHH,5)
// PWM5PHH<PWM5PHH6>
extern volatile __bit                   PWM5PHH6            __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 PWM5PHH6_bit        _BIT_ACCESS(PWM5PHH,6)
// PWM5PHH<PWM5PHH7>
extern volatile __bit                   PWM5PHH7            __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 PWM5PHH7_bit        _BIT_ACCESS(PWM5PHH,7)
// PWM5INTE<PWM5PHIE>
extern volatile __bit                   PWM5PHIE            __at(0x6CE2);	// @ (0xD9C * 8 + 2)
#define                                 PWM5PHIE_bit        _BIT_ACCESS(PWM5INTE,2)
// PWM5INTF<PWM5PHIF>
extern volatile __bit                   PWM5PHIF            __at(0x6CEA);	// @ (0xD9D * 8 + 2)
#define                                 PWM5PHIF_bit        _BIT_ACCESS(PWM5INTF,2)
// PWM5PHL<PWM5PHL0>
extern volatile __bit                   PWM5PHL0            __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 PWM5PHL0_bit        _BIT_ACCESS(PWM5PHL,0)
// PWM5PHL<PWM5PHL1>
extern volatile __bit                   PWM5PHL1            __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 PWM5PHL1_bit        _BIT_ACCESS(PWM5PHL,1)
// PWM5PHL<PWM5PHL2>
extern volatile __bit                   PWM5PHL2            __at(0x6C8A);	// @ (0xD91 * 8 + 2)
#define                                 PWM5PHL2_bit        _BIT_ACCESS(PWM5PHL,2)
// PWM5PHL<PWM5PHL3>
extern volatile __bit                   PWM5PHL3            __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 PWM5PHL3_bit        _BIT_ACCESS(PWM5PHL,3)
// PWM5PHL<PWM5PHL4>
extern volatile __bit                   PWM5PHL4            __at(0x6C8C);	// @ (0xD91 * 8 + 4)
#define                                 PWM5PHL4_bit        _BIT_ACCESS(PWM5PHL,4)
// PWM5PHL<PWM5PHL5>
extern volatile __bit                   PWM5PHL5            __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 PWM5PHL5_bit        _BIT_ACCESS(PWM5PHL,5)
// PWM5PHL<PWM5PHL6>
extern volatile __bit                   PWM5PHL6            __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 PWM5PHL6_bit        _BIT_ACCESS(PWM5PHL,6)
// PWM5PHL<PWM5PHL7>
extern volatile __bit                   PWM5PHL7            __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 PWM5PHL7_bit        _BIT_ACCESS(PWM5PHL,7)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x6CDC);	// @ (0xD9B * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// PWM5PRH<PWM5PRH0>
extern volatile __bit                   PWM5PRH0            __at(0x6CB0);	// @ (0xD96 * 8 + 0)
#define                                 PWM5PRH0_bit        _BIT_ACCESS(PWM5PRH,0)
// PWM5PRH<PWM5PRH1>
extern volatile __bit                   PWM5PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM5PRH1_bit        _BIT_ACCESS(PWM5PRH,1)
// PWM5PRH<PWM5PRH2>
extern volatile __bit                   PWM5PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM5PRH2_bit        _BIT_ACCESS(PWM5PRH,2)
// PWM5PRH<PWM5PRH3>
extern volatile __bit                   PWM5PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
#define                                 PWM5PRH3_bit        _BIT_ACCESS(PWM5PRH,3)
// PWM5PRH<PWM5PRH4>
extern volatile __bit                   PWM5PRH4            __at(0x6CB4);	// @ (0xD96 * 8 + 4)
#define                                 PWM5PRH4_bit        _BIT_ACCESS(PWM5PRH,4)
// PWM5PRH<PWM5PRH5>
extern volatile __bit                   PWM5PRH5            __at(0x6CB5);	// @ (0xD96 * 8 + 5)
#define                                 PWM5PRH5_bit        _BIT_ACCESS(PWM5PRH,5)
// PWM5PRH<PWM5PRH6>
extern volatile __bit                   PWM5PRH6            __at(0x6CB6);	// @ (0xD96 * 8 + 6)
#define                                 PWM5PRH6_bit        _BIT_ACCESS(PWM5PRH,6)
// PWM5PRH<PWM5PRH7>
extern volatile __bit                   PWM5PRH7            __at(0x6CB7);	// @ (0xD96 * 8 + 7)
#define                                 PWM5PRH7_bit        _BIT_ACCESS(PWM5PRH,7)
// PWM5INTE<PWM5PRIE>
extern volatile __bit                   PWM5PRIE            __at(0x6CE0);	// @ (0xD9C * 8 + 0)
#define                                 PWM5PRIE_bit        _BIT_ACCESS(PWM5INTE,0)
// PWM5INTF<PWM5PRIF>
extern volatile __bit                   PWM5PRIF            __at(0x6CE8);	// @ (0xD9D * 8 + 0)
#define                                 PWM5PRIF_bit        _BIT_ACCESS(PWM5INTF,0)
// PWM5PRL<PWM5PRL0>
extern volatile __bit                   PWM5PRL0            __at(0x6CA8);	// @ (0xD95 * 8 + 0)
#define                                 PWM5PRL0_bit        _BIT_ACCESS(PWM5PRL,0)
// PWM5PRL<PWM5PRL1>
extern volatile __bit                   PWM5PRL1            __at(0x6CA9);	// @ (0xD95 * 8 + 1)
#define                                 PWM5PRL1_bit        _BIT_ACCESS(PWM5PRL,1)
// PWM5PRL<PWM5PRL2>
extern volatile __bit                   PWM5PRL2            __at(0x6CAA);	// @ (0xD95 * 8 + 2)
#define                                 PWM5PRL2_bit        _BIT_ACCESS(PWM5PRL,2)
// PWM5PRL<PWM5PRL3>
extern volatile __bit                   PWM5PRL3            __at(0x6CAB);	// @ (0xD95 * 8 + 3)
#define                                 PWM5PRL3_bit        _BIT_ACCESS(PWM5PRL,3)
// PWM5PRL<PWM5PRL4>
extern volatile __bit                   PWM5PRL4            __at(0x6CAC);	// @ (0xD95 * 8 + 4)
#define                                 PWM5PRL4_bit        _BIT_ACCESS(PWM5PRL,4)
// PWM5PRL<PWM5PRL5>
extern volatile __bit                   PWM5PRL5            __at(0x6CAD);	// @ (0xD95 * 8 + 5)
#define                                 PWM5PRL5_bit        _BIT_ACCESS(PWM5PRL,5)
// PWM5PRL<PWM5PRL6>
extern volatile __bit                   PWM5PRL6            __at(0x6CAE);	// @ (0xD95 * 8 + 6)
#define                                 PWM5PRL6_bit        _BIT_ACCESS(PWM5PRL,6)
// PWM5PRL<PWM5PRL7>
extern volatile __bit                   PWM5PRL7            __at(0x6CAF);	// @ (0xD95 * 8 + 7)
#define                                 PWM5PRL7_bit        _BIT_ACCESS(PWM5PRL,7)
// PWM5CLKCON<PWM5PS0>
extern volatile __bit                   PWM5PS0             __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 PWM5PS0_bit         _BIT_ACCESS(PWM5CLKCON,4)
// PWM5CLKCON<PWM5PS1>
extern volatile __bit                   PWM5PS1             __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 PWM5PS1_bit         _BIT_ACCESS(PWM5CLKCON,5)
// PWM5CLKCON<PWM5PS2>
extern volatile __bit                   PWM5PS2             __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 PWM5PS2_bit         _BIT_ACCESS(PWM5CLKCON,6)
// PWM5TMRH<PWM5TMRH0>
extern volatile __bit                   PWM5TMRH0           __at(0x6CD0);	// @ (0xD9A * 8 + 0)
#define                                 PWM5TMRH0_bit       _BIT_ACCESS(PWM5TMRH,0)
// PWM5TMRH<PWM5TMRH1>
extern volatile __bit                   PWM5TMRH1           __at(0x6CD1);	// @ (0xD9A * 8 + 1)
#define                                 PWM5TMRH1_bit       _BIT_ACCESS(PWM5TMRH,1)
// PWM5TMRH<PWM5TMRH2>
extern volatile __bit                   PWM5TMRH2           __at(0x6CD2);	// @ (0xD9A * 8 + 2)
#define                                 PWM5TMRH2_bit       _BIT_ACCESS(PWM5TMRH,2)
// PWM5TMRH<PWM5TMRH3>
extern volatile __bit                   PWM5TMRH3           __at(0x6CD3);	// @ (0xD9A * 8 + 3)
#define                                 PWM5TMRH3_bit       _BIT_ACCESS(PWM5TMRH,3)
// PWM5TMRH<PWM5TMRH4>
extern volatile __bit                   PWM5TMRH4           __at(0x6CD4);	// @ (0xD9A * 8 + 4)
#define                                 PWM5TMRH4_bit       _BIT_ACCESS(PWM5TMRH,4)
// PWM5TMRH<PWM5TMRH5>
extern volatile __bit                   PWM5TMRH5           __at(0x6CD5);	// @ (0xD9A * 8 + 5)
#define                                 PWM5TMRH5_bit       _BIT_ACCESS(PWM5TMRH,5)
// PWM5TMRH<PWM5TMRH6>
extern volatile __bit                   PWM5TMRH6           __at(0x6CD6);	// @ (0xD9A * 8 + 6)
#define                                 PWM5TMRH6_bit       _BIT_ACCESS(PWM5TMRH,6)
// PWM5TMRH<PWM5TMRH7>
extern volatile __bit                   PWM5TMRH7           __at(0x6CD7);	// @ (0xD9A * 8 + 7)
#define                                 PWM5TMRH7_bit       _BIT_ACCESS(PWM5TMRH,7)
// PWM5TMRL<PWM5TMRL0>
extern volatile __bit                   PWM5TMRL0           __at(0x6CC8);	// @ (0xD99 * 8 + 0)
#define                                 PWM5TMRL0_bit       _BIT_ACCESS(PWM5TMRL,0)
// PWM5TMRL<PWM5TMRL1>
extern volatile __bit                   PWM5TMRL1           __at(0x6CC9);	// @ (0xD99 * 8 + 1)
#define                                 PWM5TMRL1_bit       _BIT_ACCESS(PWM5TMRL,1)
// PWM5TMRL<PWM5TMRL2>
extern volatile __bit                   PWM5TMRL2           __at(0x6CCA);	// @ (0xD99 * 8 + 2)
#define                                 PWM5TMRL2_bit       _BIT_ACCESS(PWM5TMRL,2)
// PWM5TMRL<PWM5TMRL3>
extern volatile __bit                   PWM5TMRL3           __at(0x6CCB);	// @ (0xD99 * 8 + 3)
#define                                 PWM5TMRL3_bit       _BIT_ACCESS(PWM5TMRL,3)
// PWM5TMRL<PWM5TMRL4>
extern volatile __bit                   PWM5TMRL4           __at(0x6CCC);	// @ (0xD99 * 8 + 4)
#define                                 PWM5TMRL4_bit       _BIT_ACCESS(PWM5TMRL,4)
// PWM5TMRL<PWM5TMRL5>
extern volatile __bit                   PWM5TMRL5           __at(0x6CCD);	// @ (0xD99 * 8 + 5)
#define                                 PWM5TMRL5_bit       _BIT_ACCESS(PWM5TMRL,5)
// PWM5TMRL<PWM5TMRL6>
extern volatile __bit                   PWM5TMRL6           __at(0x6CCE);	// @ (0xD99 * 8 + 6)
#define                                 PWM5TMRL6_bit       _BIT_ACCESS(PWM5TMRL,6)
// PWM5TMRL<PWM5TMRL7>
extern volatile __bit                   PWM5TMRL7           __at(0x6CCF);	// @ (0xD99 * 8 + 7)
#define                                 PWM5TMRL7_bit       _BIT_ACCESS(PWM5TMRL,7)
// PWM3DCL<PWMPW0>
extern volatile __bit                   PWMPW0              __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWMPW0_bit          _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWMPW1>
extern volatile __bit                   PWMPW1              __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWMPW1_bit          _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<PWMPW2>
extern volatile __bit                   PWMPW2              __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWMPW2_bit          _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWMPW3>
extern volatile __bit                   PWMPW3              __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWMPW3_bit          _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWMPW4>
extern volatile __bit                   PWMPW4              __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWMPW4_bit          _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWMPW5>
extern volatile __bit                   PWMPW5              __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWMPW5_bit          _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWMPW6>
extern volatile __bit                   PWMPW6              __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWMPW6_bit          _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWMPW7>
extern volatile __bit                   PWMPW7              __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWMPW7_bit          _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWMPW8>
extern volatile __bit                   PWMPW8              __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWMPW8_bit          _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWMPW9>
extern volatile __bit                   PWMPW9              __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWMPW9_bit          _BIT_ACCESS(PWM3DCH,7)
// DAC1REFH<R10>
extern volatile __bit                   R10                 __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 R10_bit             _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<R11>
extern volatile __bit                   R11                 __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 R11_bit             _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<R12>
extern volatile __bit                   R12                 __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 R12_bit             _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<R13>
extern volatile __bit                   R13                 __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 R13_bit             _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<R14>
extern volatile __bit                   R14                 __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 R14_bit             _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<R15>
extern volatile __bit                   R15                 __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 R15_bit             _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<R5>
extern volatile __bit                   R5                  __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 R5_bit              _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<R6>
extern volatile __bit                   R6                  __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 R6_bit              _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<R7>
extern volatile __bit                   R7                  __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 R7_bit              _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<R8>
