MikroElektronika/core_packages/PIC/XC8/def/PIC16F1765/mcu.h
extern volatile __bit                   R8                  __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 R8_bit              _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<R9>
extern volatile __bit                   R9                  __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 R9_bit              _BIT_ACCESS(DAC1REFH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// PMCON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(PMCON1,0)
// COG1CON1<RDBS>
extern volatile __bit                   RDBS                __at(0x34A7);	// @ (0x694 * 8 + 7)
#define                                 RDBS_bit            _BIT_ACCESS(COG1CON1,7)
// PRG1CON1<RDY>
extern volatile __bit                   RDY                 __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 RDY_bit             _BIT_ACCESS(PRG1CON1,2)
// PRG1CON0<REDG>
extern volatile __bit                   REDG                __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 REDG_bit            _BIT_ACCESS(PRG1CON0,4)
// DAC1REFH<REF10>
extern volatile __bit                   REF10               __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 REF10_bit           _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<REF11>
extern volatile __bit                   REF11               __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 REF11_bit           _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<REF12>
extern volatile __bit                   REF12               __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 REF12_bit           _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<REF13>
extern volatile __bit                   REF13               __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 REF13_bit           _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<REF14>
extern volatile __bit                   REF14               __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 REF14_bit           _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<REF15>
extern volatile __bit                   REF15               __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 REF15_bit           _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<REF6>
extern volatile __bit                   REF6                __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 REF6_bit            _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<REF7>
extern volatile __bit                   REF7                __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 REF7_bit            _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<REF8>
extern volatile __bit                   REF8                __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 REF8_bit            _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<REF9>
extern volatile __bit                   REF9                __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 REF9_bit            _BIT_ACCESS(DAC1REFH,1)
// PRG1CON0<RG1EN>
extern volatile __bit                   RG1EN               __at(0x3CBF);	// @ (0x797 * 8 + 7)
#define                                 RG1EN_bit           _BIT_ACCESS(PRG1CON0,7)
// PRG1CON0<RG1FEDG>
extern volatile __bit                   RG1FEDG             __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 RG1FEDG_bit         _BIT_ACCESS(PRG1CON0,5)
// PRG1CON1<RG1FPOL>
extern volatile __bit                   RG1FPOL             __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 RG1FPOL_bit         _BIT_ACCESS(PRG1CON1,1)
// PRG1FTSS<RG1FTSS0>
extern volatile __bit                   RG1FTSS0            __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 RG1FTSS0_bit        _BIT_ACCESS(PRG1FTSS,0)
// PRG1FTSS<RG1FTSS1>
extern volatile __bit                   RG1FTSS1            __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 RG1FTSS1_bit        _BIT_ACCESS(PRG1FTSS,1)
// PRG1FTSS<RG1FTSS2>
extern volatile __bit                   RG1FTSS2            __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 RG1FTSS2_bit        _BIT_ACCESS(PRG1FTSS,2)
// PRG1FTSS<RG1FTSS3>
extern volatile __bit                   RG1FTSS3            __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 RG1FTSS3_bit        _BIT_ACCESS(PRG1FTSS,3)
// PRG1CON0<RG1GO>
extern volatile __bit                   RG1GO               __at(0x3CB8);	// @ (0x797 * 8 + 0)
#define                                 RG1GO_bit           _BIT_ACCESS(PRG1CON0,0)
// PRG1INS<RG1INS0>
extern volatile __bit                   RG1INS0             __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 RG1INS0_bit         _BIT_ACCESS(PRG1INS,0)
// PRG1INS<RG1INS1>
extern volatile __bit                   RG1INS1             __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 RG1INS1_bit         _BIT_ACCESS(PRG1INS,1)
// PRG1INS<RG1INS2>
extern volatile __bit                   RG1INS2             __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 RG1INS2_bit         _BIT_ACCESS(PRG1INS,2)
// PRG1INS<RG1INS3>
extern volatile __bit                   RG1INS3             __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 RG1INS3_bit         _BIT_ACCESS(PRG1INS,3)
// PRG1CON2<RG1ISET0>
extern volatile __bit                   RG1ISET0            __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 RG1ISET0_bit        _BIT_ACCESS(PRG1CON2,0)
// PRG1CON2<RG1ISET1>
extern volatile __bit                   RG1ISET1            __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 RG1ISET1_bit        _BIT_ACCESS(PRG1CON2,1)
// PRG1CON2<RG1ISET2>
extern volatile __bit                   RG1ISET2            __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 RG1ISET2_bit        _BIT_ACCESS(PRG1CON2,2)
// PRG1CON2<RG1ISET3>
extern volatile __bit                   RG1ISET3            __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 RG1ISET3_bit        _BIT_ACCESS(PRG1CON2,3)
// PRG1CON2<RG1ISET4>
extern volatile __bit                   RG1ISET4            __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 RG1ISET4_bit        _BIT_ACCESS(PRG1CON2,4)
// PRG1CON0<RG1MODE0>
extern volatile __bit                   RG1MODE0            __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 RG1MODE0_bit        _BIT_ACCESS(PRG1CON0,2)
// PRG1CON0<RG1MODE1>
extern volatile __bit                   RG1MODE1            __at(0x3CBB);	// @ (0x797 * 8 + 3)
#define                                 RG1MODE1_bit        _BIT_ACCESS(PRG1CON0,3)
// PRG1CON0<RG1OS>
extern volatile __bit                   RG1OS               __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 RG1OS_bit           _BIT_ACCESS(PRG1CON0,1)
// PRG1CON1<RG1RDY>
extern volatile __bit                   RG1RDY              __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 RG1RDY_bit          _BIT_ACCESS(PRG1CON1,2)
// PRG1CON0<RG1REDG>
extern volatile __bit                   RG1REDG             __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 RG1REDG_bit         _BIT_ACCESS(PRG1CON0,4)
// PRG1CON1<RG1RPOL>
extern volatile __bit                   RG1RPOL             __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 RG1RPOL_bit         _BIT_ACCESS(PRG1CON1,0)
// PRG1RTSS<RG1RTSS0>
extern volatile __bit                   RG1RTSS0            __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 RG1RTSS0_bit        _BIT_ACCESS(PRG1RTSS,0)
// PRG1RTSS<RG1RTSS1>
extern volatile __bit                   RG1RTSS1            __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 RG1RTSS1_bit        _BIT_ACCESS(PRG1RTSS,1)
// PRG1RTSS<RG1RTSS2>
extern volatile __bit                   RG1RTSS2            __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 RG1RTSS2_bit        _BIT_ACCESS(PRG1RTSS,2)
// PRG1RTSS<RG1RTSS3>
extern volatile __bit                   RG1RTSS3            __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 RG1RTSS3_bit        _BIT_ACCESS(PRG1RTSS,3)
// COG1RIS0<RIS0>
extern volatile __bit                   RIS0                __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 RIS0_bit            _BIT_ACCESS(COG1RIS0,0)
// COG1RIS0<RIS1>
extern volatile __bit                   RIS1                __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 RIS1_bit            _BIT_ACCESS(COG1RIS0,1)
// COG1RIS1<RIS10>
extern volatile __bit                   RIS10               __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 RIS10_bit           _BIT_ACCESS(COG1RIS1,2)
// COG1RIS1<RIS11>
extern volatile __bit                   RIS11               __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 RIS11_bit           _BIT_ACCESS(COG1RIS1,3)
// COG1RIS1<RIS12>
extern volatile __bit                   RIS12               __at(0x34B4);	// @ (0x696 * 8 + 4)
#define                                 RIS12_bit           _BIT_ACCESS(COG1RIS1,4)
// COG1RIS1<RIS13>
extern volatile __bit                   RIS13               __at(0x34B5);	// @ (0x696 * 8 + 5)
#define                                 RIS13_bit           _BIT_ACCESS(COG1RIS1,5)
// COG1RIS1<RIS14>
extern volatile __bit                   RIS14               __at(0x34B6);	// @ (0x696 * 8 + 6)
#define                                 RIS14_bit           _BIT_ACCESS(COG1RIS1,6)
// COG1RIS0<RIS2>
extern volatile __bit                   RIS2                __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 RIS2_bit            _BIT_ACCESS(COG1RIS0,2)
// COG1RIS0<RIS3>
extern volatile __bit                   RIS3                __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 RIS3_bit            _BIT_ACCESS(COG1RIS0,3)
// COG1RIS0<RIS4>
extern volatile __bit                   RIS4                __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 RIS4_bit            _BIT_ACCESS(COG1RIS0,4)
// COG1RIS0<RIS5>
extern volatile __bit                   RIS5                __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 RIS5_bit            _BIT_ACCESS(COG1RIS0,5)
// COG1RIS0<RIS6>
extern volatile __bit                   RIS6                __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 RIS6_bit            _BIT_ACCESS(COG1RIS0,6)
// COG1RIS0<RIS7>
extern volatile __bit                   RIS7                __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 RIS7_bit            _BIT_ACCESS(COG1RIS0,7)
// COG1RIS1<RIS8>
extern volatile __bit                   RIS8                __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 RIS8_bit            _BIT_ACCESS(COG1RIS1,0)
// COG1RIS1<RIS9>
extern volatile __bit                   RIS9                __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 RIS9_bit            _BIT_ACCESS(COG1RIS1,1)
// PRG1CON1<RPOL>
extern volatile __bit                   RPOL                __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 RPOL_bit            _BIT_ACCESS(PRG1CON1,0)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// COG1RSIM0<RSIM0>
extern volatile __bit                   RSIM0               __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 RSIM0_bit           _BIT_ACCESS(COG1RSIM0,0)
// COG1RSIM0<RSIM1>
extern volatile __bit                   RSIM1               __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 RSIM1_bit           _BIT_ACCESS(COG1RSIM0,1)
// COG1RSIM1<RSIM10>
extern volatile __bit                   RSIM10              __at(0x34C2);	// @ (0x698 * 8 + 2)
#define                                 RSIM10_bit          _BIT_ACCESS(COG1RSIM1,2)
// COG1RSIM1<RSIM11>
extern volatile __bit                   RSIM11              __at(0x34C3);	// @ (0x698 * 8 + 3)
#define                                 RSIM11_bit          _BIT_ACCESS(COG1RSIM1,3)
// COG1RSIM1<RSIM12>
extern volatile __bit                   RSIM12              __at(0x34C4);	// @ (0x698 * 8 + 4)
#define                                 RSIM12_bit          _BIT_ACCESS(COG1RSIM1,4)
// COG1RSIM1<RSIM13>
extern volatile __bit                   RSIM13              __at(0x34C5);	// @ (0x698 * 8 + 5)
#define                                 RSIM13_bit          _BIT_ACCESS(COG1RSIM1,5)
// COG1RSIM1<RSIM14>
extern volatile __bit                   RSIM14              __at(0x34C6);	// @ (0x698 * 8 + 6)
#define                                 RSIM14_bit          _BIT_ACCESS(COG1RSIM1,6)
// COG1RSIM0<RSIM2>
extern volatile __bit                   RSIM2               __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 RSIM2_bit           _BIT_ACCESS(COG1RSIM0,2)
// COG1RSIM0<RSIM3>
extern volatile __bit                   RSIM3               __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 RSIM3_bit           _BIT_ACCESS(COG1RSIM0,3)
// COG1RSIM0<RSIM4>
extern volatile __bit                   RSIM4               __at(0x34BC);	// @ (0x697 * 8 + 4)
#define                                 RSIM4_bit           _BIT_ACCESS(COG1RSIM0,4)
// COG1RSIM0<RSIM5>
extern volatile __bit                   RSIM5               __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 RSIM5_bit           _BIT_ACCESS(COG1RSIM0,5)
// COG1RSIM0<RSIM6>
extern volatile __bit                   RSIM6               __at(0x34BE);	// @ (0x697 * 8 + 6)
#define                                 RSIM6_bit           _BIT_ACCESS(COG1RSIM0,6)
// COG1RSIM0<RSIM7>
extern volatile __bit                   RSIM7               __at(0x34BF);	// @ (0x697 * 8 + 7)
#define                                 RSIM7_bit           _BIT_ACCESS(COG1RSIM0,7)
// COG1RSIM1<RSIM8>
extern volatile __bit                   RSIM8               __at(0x34C0);	// @ (0x698 * 8 + 0)
#define                                 RSIM8_bit           _BIT_ACCESS(COG1RSIM1,0)
// COG1RSIM1<RSIM9>
extern volatile __bit                   RSIM9               __at(0x34C1);	// @ (0x698 * 8 + 1)
#define                                 RSIM9_bit           _BIT_ACCESS(COG1RSIM1,1)
// PRG1RTSS<RTSS0>
extern volatile __bit                   RTSS0               __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 RTSS0_bit           _BIT_ACCESS(PRG1RTSS,0)
// PRG1RTSS<RTSS1>
extern volatile __bit                   RTSS1               __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 RTSS1_bit           _BIT_ACCESS(PRG1RTSS,1)
// PRG1RTSS<RTSS2>
extern volatile __bit                   RTSS2               __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 RTSS2_bit           _BIT_ACCESS(PRG1RTSS,2)
// PRG1RTSS<RTSS3>
extern volatile __bit                   RTSS3               __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 RTSS3_bit           _BIT_ACCESS(PRG1RTSS,3)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x10EF);	// @ (0x21D * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// COG1STR<SDATA>
extern volatile __bit                   SDATA               __at(0x34FC);	// @ (0x69F * 8 + 4)
#define                                 SDATA_bit           _BIT_ACCESS(COG1STR,4)
// COG1STR<SDATB>
extern volatile __bit                   SDATB               __at(0x34FD);	// @ (0x69F * 8 + 5)
#define                                 SDATB_bit           _BIT_ACCESS(COG1STR,5)
// COG1STR<SDATC>
extern volatile __bit                   SDATC               __at(0x34FE);	// @ (0x69F * 8 + 6)
#define                                 SDATC_bit           _BIT_ACCESS(COG1STR,6)
// COG1STR<SDATD>
extern volatile __bit                   SDATD               __at(0x34FF);	// @ (0x69F * 8 + 7)
#define                                 SDATD_bit           _BIT_ACCESS(COG1STR,7)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SSP1STAT<SMP>
